Автосервис/src/Documents/Калькуляция/Калькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Калькуляция</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВладельцыАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.АвтомобилиКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Автодетали</name>
    <attributes>
      <name>Автодеталь</name>
      <type>
        <types>CatalogRef.Автодетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал1</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Материал2</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Материал3</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаботу</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Автосервис/src/Documents/Калькуляция/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции


&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	СтрокаТабличнойЧасти.НормаЧас = РассчитатьНормаЧасы(СтрокаТабличнойЧасти.Работа, СтрокаТабличнойЧасти.Количество)
КонецПроцедуры
